{
  "nodes": [
    {
      "id": 0,
      "name": "Документация",
      "text": "Качество документации напрямую влияет на то, как быстро разработчик сможет освоить ПО и использовать полученные знания в реальной разработке. Документация должна быть не перегружена лишней информацией, полностью пояснять функционал, коротко и понятно раскрывать механизм работы ПО, чтобы потенциальный разработчик мог с легкостью начать использовать его."
    },
    {
      "id": 1,
      "name": "Популярность",
      "text": "Несмотря на то, что популярность довольно субъективный фактор, от нее напрямую зависит продолжительность и качество выпускаемого продукта. Чем известнее библиотека, тем выше вероятность того, что она будет активно развиваться и поддерживаться. К тому же, популярность влияет и на количество комьюнити, которое использует библиотеку, что способствует нахождению багов, поддержке, дальнейшему продвижению."
    },
    {
      "id": 2,
      "name": "Размер",
      "text": "Размер используемой библиотеки является важным параметром при разработке любого проекта. Чем больше она по размеру, тем дольше будет первая загрузка сайта, что плохо, поскольку первичное впечатление от сайта зачастую становится решающим фактором в том, чтобы остаться на нем или покинуть его. Так как версии и размер библиотек различаются по своему функционалу и требованиям к проекту, имеет смысл рассмотреть базовые конфигурации."
    },
    {
      "id": 3,
      "name": "Масштабируемость",
      "text": "Еще одним значимым параметром при выборе библиотеки управления состоянием является возможность дальнейшего масштабирования, так как это напрямую влияет на то, как быстро разработчики смогут перестроить свое веб-приложение под новый функционал."
    },
    {
      "id": 4,
      "name": "Производительность в одинаковых условиях",
      "text": "В качестве эксперимента предлагается протестировать время, за которое компонент прорендерится 100 000 раз. Условия рендеринга для чистоты эксперимента будут одинаковыми, каждая библиотека будет работать с одним и тем же приложением, с одним и тем же вызовом. Возможность оптимизации в расчет не берется, поскольку главная цель эксперимента сравнить стандартные возможности менеджеров управления событий."
    }
  ]
}
