{
  "nodes": [
    {
      "id": 0,
      "library": "Redux",
      "body": [
        {
          "id": 0,
          "name": "Документация Redux",
          "text": "Redux, в современном своем представлении, является не просто одной библиотекой, это целая экосистема, состоящая из нескольких библиотек, не только для управления состоянием. В связи с чем документация Redux очень расширена, она состоит из нескольких частей, и для полноценного использования всей экосистемы Redux необходимо освоить их все хотя бы в базовом понимании. Это усложняет обучение для начинающего разработчика."
        },
        {
          "id": 1,
          "name": "Популярность Redux",
          "text": "cc"
        },
        {
          "id": 2,
          "name": "Размер библиотеки Redux",
          "text": "cc"
        },
        {
          "id": 3,
          "name": "Масштабируемость Redux",
          "text": "cc"
        },
        {
          "id": 4,
          "name": "Эксперимент Redux",
          "text": "cc"
        }
      ]
    },
    {
      "id": 1,
      "library": "MobX",
      "body": [
        {
          "id": 0,
          "name": "Документация MobX",
          "text": "MobX не имеет своей экосистемы, подобной Redux. Данная библиотека заточена только под управление состоянием компонентов, что делает ее документацию намного меньше чем в Redux. Однако это не означает, что ее функционал урезан по сравнению с Redux в направлении управления состояния, данная библиотека вполне может составить достойную конкуренцию с Redux. Документация MobX коротка и понятна, что делает ее изучение более быстрым в сравнении с Redux."
        },
        {
          "id": 1,
          "name": "Популярность MobX",
          "text": "cc"
        },
        {
          "id": 2,
          "name": "Размер библиотеки MobX",
          "text": "cc"
        },
        {
          "id": 3,
          "name": "Масштабируемость MobX",
          "text": "cc"
        },
        {
          "id": 4,
          "name": "Эксперимент MobX",
          "text": "cc"
        }
      ]
    },
    {
      "id": 2,
      "library": "Recoil",
      "body": [
        {
          "id": 0,
          "name": "Документация Recoil",
          "text": "Recoil, в настоящее время, только начинает набирать обороты в мире веб-разработки. Как и MobX, Recoil разработан в первую очередь для управления состоянием, поэтому размер его документации не сильно отличается от размера документации MobX [4]. Тем ни менее, на момент написания данного текста полноценного релиза Recoil еще не было (актуальная на текущий момент версия Recoil – 0.7.6), поэтому документацию Recoil в текущем ее виде нельзя назвать полноценной несмотря на то, как активно продвигает данную библиотеку компания-создатель React."
        },
        {
          "id": 1,
          "name": "Популярность Recoil",
          "text": "cc"
        },
        {
          "id": 2,
          "name": "Размер библиотеки Recoil",
          "text": "cc"
        },
        {
          "id": 3,
          "name": "Масштабируемость Recoil",
          "text": "cc"
        },
        {
          "id": 4,
          "name": "Эксперимент Recoil",
          "text": "cc"
        }
      ]
    }
  ]
}
